<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b6e50081e76b386b756a954203d2e29cf98d1952f7050f442d92b010df5a4de8","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #810 at https://github.com/cal-itp/data-infra/actions/runs/18548343273","plan_out_hash":"f11a5eec400ccdac00bbe5a6b55e518c0dc37bc14993f38369d8bee9072d86b0","plan_hash":"c976cb32344c2bf63dd99d12f48d71a76c844b013e5903ba9c94ee0f5c1db175","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/audit/_mart_audit.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "waR2eg==" -> (known after apply)
!~      detect_md5hash      = "VihuHbwo2n9vDyUrdfbV/A==" -> "different hash"
!~      generation          = 1760576370888285 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/audit/_mart_audit.yml"
!~      md5hash             = "VihuHbwo2n9vDyUrdfbV/A==" -> (known after apply)
        name                = "data/warehouse/models/mart/audit/_mart_audit.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/audit/fct_bigquery_data_access.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "Y/p4oQ==" -> (known after apply)
!~      detect_md5hash      = "b+ajCuGyx9EUBX+RYSjWeA==" -> "different hash"
!~      generation          = 1760576370885310 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/audit/fct_bigquery_data_access.sql"
!~      md5hash             = "b+ajCuGyx9EUBX+RYSjWeA==" -> (known after apply)
        name                = "data/warehouse/models/mart/audit/fct_bigquery_data_access.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #810](https://github.com/cal-itp/data-infra/actions/runs/18548343273)